local _, ns = ...
local _, C = unpack(ns)
C.CustomUnits = {
	-- Corruption
	[162290] = true, -- 腐化的觅血鲨
	[162247] = true, -- 腐化的狱卒
	[162251] = true, -- 腐化的召唤师
	[162245] = true, -- 腐化的折磨者
	[162248] = true, -- 腐化的守护者
	-- Nzoth vision
	[153401] = true, 	-- 克熙尔支配者
	[157610] = true, 	-- 克熙尔支配者
	[156795] = true, 	-- 军情七处线人
	-- Dungeons
	[120651] = true, 	-- 大米，爆炸物
	[204560] = true, 	-- 大米，虚体生物
	[104251] = true, 	-- 群星庭院，哨兵
	[196548] = true,	-- 古树树枝，学院
	[52019] = true,		-- 坠天新星，旋云之巅
	[137103] = true,	-- 血面兽，地渊
	[92538] = true,		-- 喷油蛆虫，巢穴
	[190426] = true,	-- 腐朽图腾，蕨皮
	[190381] = true,	-- 腐爆图腾，蕨皮
	[186696] = true,	-- 撼地图腾，提尔
	[84400] = true,		-- 繁盛古树，永茂林地
	[199368] = true,	-- 硬化的水晶，碧蓝魔馆
	-- Condemned Demon
	[169430] = true,
	[169428] = true,
	[168932] = true,
	[169425] = true,
	[169429] = true,
	[169421] = true,
	[169426] = true,
	-- TWW S1
	[165251] = true,	-- 幻影仙狐，仙林
	[224276] = true,	-- 暮光执行者，格瑞姆巴托
}

-- 显示姓名板单位的目标
C.ShowTargetNPCs = {
	--[165251] = true,	-- 仙林狐狸
	[40357] = true,		-- 格瑞姆巴托火元素
	[164702] = true,	-- 食腐蛆虫
	[174773] = true,	-- 怨毒怪
}

-- 无效目标
C.TrashUnits = {
	[174773] = true, 	-- 大米，怨毒影魔
	[190174] = true,	-- 催眠蝙蝠，S4
	[166589] = true,	-- 活化武器，赤红
	[169753] = true,	-- 饥饿的虱子，赤红
	[175677] = true,	-- 走私来的生物，集市
	[190407] = true,	-- 水波暴怒者，注能大厅
}
