local _, C, _, _ = unpack(select(2, ...))

-- 控制技能列表
C.WhiteList = {
	-- 死亡骑士
	[108194]	= true,		-- 窒息
	[221562]	= true,		-- 窒息
	[207171]	= true,		-- 凛冬将至
	-- 德鲁伊
	[33786] 	= true,		-- 旋风
	[339]		= true,		-- 纠缠根须
	[102359]	= true,		-- 群体缠绕
	[5211]		= true,		-- 蛮力猛击
	[127797]	= true,		-- 乌索尔旋风
	[81261]		= true,		-- 日光术
	-- 猎人
	[3355]		= true,		-- 冰冻陷阱
	[19386] 	= true,		-- 翼龙钉刺
	[213691] 	= true,		-- 驱散射击
	[224729] 	= true,		-- 爆裂射击
	[202797] 	= true,		-- 蝰蛇钉刺
	[202900] 	= true,		-- 毒蝎钉刺
	[117526]	= true,		-- 束缚射击
	-- 法师
	[118] 		= true,		-- 变形术
	-- 圣骑士
	[20066] 	= true,		-- 忏悔
	[853] 		= true,		-- 制裁之锤
	-- 牧师
	[8122] 		= true,		-- 心灵尖啸
	[9484] 		= true,		-- 束缚亡灵
	[15487] 	= true,		-- 沉默
	[605] 		= true,		-- 心控
	[205369] 	= true,		-- 心灵炸弹
	-- 盗贼
	[2094] 		= true,		-- 致盲
	[6770] 		= true,		-- 闷棍
	-- 萨满
	[51514] 	= true,		-- 妖术
	[118905] 	= true,		-- 静电充能
	-- 术士
	[710] 		= true,		-- 放逐术
	[118699] 	= true,		-- 恐惧
	[5484] 		= true,		-- 恐惧嚎叫
	[6358]		= true,		-- 诱惑
	[30283] 	= true,		-- 暗影之怒
	-- 战士
	[132168] 	= true,		-- 震荡波
	[132169] 	= true,		-- 风暴之锤
	-- 武僧
	[115078] 	= true,		-- 分筋错骨
	[119381] 	= true,		-- 扫堂腿
	-- 恶魔猎手
	[217832] 	= true,		-- 禁锢
	[179057] 	= true,		-- 混乱新星
	-- 种族技能
	[25046] 	= true,		-- 奥术洪流
	[20549] 	= true,		-- 战争践踏
	[107079] 	= true,		-- 震山掌
	-- 其他
	[226510]	= true,		-- 血池
}

-- 法术黑名单
C.BlackList = {
	[15407]		= true,		-- 精神鞭笞
}

-- 显示能量值的敌对单位
C.ShowPowerUnit = {
	["Scrubber"] = true,
	["清扫器"] = true,
	["清掃者"] = true,
}