local _, ns = ...
local _, C = unpack(ns)

-- 法术白名单
C.WhiteList = {
	[268756] = true,	-- 望远镜饰品
	-- Buffs
	[642]    = true,	-- 圣盾术
	[1022]   = true,	-- 保护之手
	[23920]  = true,	-- 法术反射
	[45438]  = true,	-- 寒冰屏障
	[186265] = true,	-- 灵龟守护
	-- Debuffs
	[2094]   = true,	-- 致盲
	[10326]  = true,	-- 超度邪恶
	[20549]  = true,	-- 战争践踏
	[107079] = true,	-- 震山掌
	[117405] = true,	-- 束缚射击
	[127797] = true,	-- 乌索尔旋风
	[272295] = true,	-- 悬赏
	-- Mythic+
	[228318] = true,	-- 激怒
	[226510] = true,	-- 血池
	[343553] = true,	-- 万噬之怨
	[343502] = true,	-- 鼓舞光环
	-- Dungeons
	[113315] = true,	-- 青龙寺，强烈
	[113309] = true,	-- 青龙寺，至高能量
	[384148] = true,	-- 诱捕陷阱，蕨皮
	[200672] = true,	-- 水晶迸裂，巢穴
	[377724] = true,	-- 小怪易伤，提尔
	[413027] = true,	-- 泰坦之壁，永恒黎明
	[258653] = true,	-- 魂能壁垒，阿塔达萨
	[255960] = true,	-- 强效巫毒，阿塔达萨
	[255967] = true,	-- 强效巫毒，阿塔达萨
	[255968] = true,	-- 强效巫毒，阿塔达萨
	[255970] = true,	-- 强效巫毒，阿塔达萨
	[255972] = true,	-- 强效巫毒，阿塔达萨
	[260805] = true,	-- 聚焦之虹，庄园
	[264027] = true,	-- 结界蜡烛，庄园
	[372824] = true,	-- 燃烧锁链，奈萨鲁斯
	-- TWW S1
	[343558] = true,	-- 通灵战潮，病态凝视
	[343470] = true,	-- 通灵战潮，碎骨之盾
	[328351] = true,	-- 通灵战潮，染血长枪
	[323149] = true,	-- 仙林，黑暗之拥
	[322569] = true,	-- 仙林，兹洛斯之手
	-- TWW S2
	[293724] = true,	-- 车间，护盾发生器
	[320293] = true,	-- 伤逝剧场，融入死亡
	[331510] = true,	-- 伤逝剧场，死亡之愿
	[333241] = true,	-- 伤逝剧场，暴脾气
}

-- 法术黑名单
C.BlackList = {
	[15407]  = true,	-- 精神鞭笞
	[51714]  = true,	-- 锋锐之霜
	[199721] = true,	-- 腐烂光环
	[214968] = true,	-- 死灵光环
	[214975] = true,	-- 抑心光环
	[273977] = true,	-- 亡者之握
	[276919] = true,	-- 承受压力
	[206930] = true,	-- 心脏打击
}

-- 特殊单位的染色列表
C.CustomUnits = {
	-- Corruption
	[162290] = true, -- 腐化的觅血鲨
	[162247] = true, -- 腐化的狱卒
	[162251] = true, -- 腐化的召唤师
	[162245] = true, -- 腐化的折磨者
	[162248] = true, -- 腐化的守护者
	-- Nzoth vision
	[153401] = true, 	-- 克熙尔支配者
	[157610] = true, 	-- 克熙尔支配者
	[156795] = true, 	-- 军情七处线人
	-- Dungeons
	[120651] = true, 	-- 大米，爆炸物
	[204560] = true, 	-- 大米，虚体生物
	[104251] = true, 	-- 群星庭院，哨兵
	[196548] = true,	-- 古树树枝，学院
	[52019] = true,		-- 坠天新星，旋云之巅
	[137103] = true,	-- 血面兽，地渊
	[92538] = true,		-- 喷油蛆虫，巢穴
	[190426] = true,	-- 腐朽图腾，蕨皮
	[190381] = true,	-- 腐爆图腾，蕨皮
	[186696] = true,	-- 撼地图腾，提尔
	[84400] = true,		-- 繁盛古树，永茂林地
	[199368] = true,	-- 硬化的水晶，碧蓝魔馆
	-- Condemned Demon
	[169430] = true,
	[169428] = true,
	[168932] = true,
	[169425] = true,
	[169429] = true,
	[169421] = true,
	[169426] = true,
	-- TWW S1
	[165251] = true,	-- 幻影仙狐，仙林
	[224276] = true,	-- 暮光执行者，格瑞姆巴托
}

-- 显示姓名板单位的目标
C.ShowTargetNPCs = {
	--[165251] = true,	-- 仙林狐狸
	[40357] = true,		-- 格瑞姆巴托火元素
	[164702] = true,	-- 食腐蛆虫
	[174773] = true,	-- 怨毒怪
}

-- 无效目标
C.TrashUnits = {
	[174773] = true, 	-- 大米，怨毒影魔
	[190174] = true,	-- 催眠蝙蝠，S4
	[166589] = true,	-- 活化武器，赤红
	[169753] = true,	-- 饥饿的虱子，赤红
	[175677] = true,	-- 走私来的生物，集市
	[190407] = true,	-- 水波暴怒者，注能大厅
}
