local _, C, _, _ = unpack(select(2, ...))

-- 法术白名单
C.WhiteList = {
	[117405]	= true,		-- 束缚射击
	-- 种族技能
	[28730] 	= true,		-- 奥术洪流
	[20549] 	= true,		-- 战争践踏
	[107079] 	= true,		-- 震山掌
	-- 其他
	[226510]	= true,		-- 血池
	[229495]	= true,		-- 象棋易伤

	[207327]	= true,		-- 净化毁灭，崔利艾克斯
	[236513]	= true,		-- 骨牢护甲，聚合体小怪
	[240315]	= true,		-- 硬化之壳，哈亚坦蛋盾
	[241521]	= true,		-- 折磨碎片，M审判庭小怪
	[250074]	= true,		-- 净化，艾欧娜尔
	[250555]	= true,		-- 邪能护盾，艾欧娜尔
	[249863]	= true,		-- 泰坦的面容，破坏魔女巫会
	[244903]	= true,		-- 催化作用，阿格拉玛
	[253021]	= true,		-- 宿命，寂灭者阿古斯
	[255496]	= true,		-- 宇宙之剑，寂灭者阿古斯
	[255478]	= true,		-- 永恒之刃，寂灭者阿古斯
}

-- 法术黑名单
C.BlackList = {
	[15407]		= true,		-- 精神鞭笞
	[240606]	= true,		-- 鸟德神器
	[240607]	= true,		-- 鸟德神器
}