local _, ns = ...
local _, C = unpack(ns)

-- 法术白名单
C.WhiteList = {
	-- Buffs
	[642]    = true,	-- 圣盾术
	[1022]   = true,	-- 保护之手
	[23920]  = true,	-- 法术反射
	[45438]  = true,	-- 寒冰屏障
	[186265] = true,	-- 灵龟守护
	-- Debuffs
	[2094]   = true,	-- 致盲
	[10326]  = true,	-- 超度邪恶
	[20549]  = true,	-- 战争践踏
	[107079] = true,	-- 震山掌
	[117405] = true,	-- 束缚射击
	[127797] = true,	-- 乌索尔旋风
	[272295] = true,	-- 悬赏
	-- Mythic+
	[228318] = true,	-- 激怒
	[226510] = true,	-- 血池
	[343553] = true,	-- 万噬之怨
	[343502] = true,	-- 鼓舞光环
	-- Dungeons
	[113315] = true,	-- 青龙寺，强烈
	[113309] = true,	-- 青龙寺，至高能量
}

-- 法术黑名单
C.BlackList = {
	[15407]  = true,	-- 精神鞭笞
	[51714]  = true,	-- 锋锐之霜
	[199721] = true,	-- 腐烂光环
	[214968] = true,	-- 死灵光环
	[214975] = true,	-- 抑心光环
	[273977] = true,	-- 亡者之握
	[276919] = true,	-- 承受压力
	[206930] = true,	-- 心脏打击
}

-- 特殊单位的染色列表
C.CustomUnits = {
	-- Nzoth vision
	[153401] = true, 	-- 克熙尔支配者
	[157610] = true, 	-- 克熙尔支配者
	[156795] = true, 	-- 军情七处线人
	-- Dungeons
	[120651] = true, 	-- 大米，爆炸物
	[174773] = true, 	-- 大米，怨毒影魔
	[104251] = true, 	-- 群星庭院，哨兵
	[196548] = true,	-- 古树树枝，学院
	-- Condemned Demon
	[169430] = true,
	[169428] = true,
	[168932] = true,
	[169425] = true,
	[169429] = true,
	[169421] = true,
	[169426] = true,
}

-- 显示能量值的单位
C.PowerUnits = {
	[56792] = true,		-- 青龙寺，怀疑臆象
	[171557] = true,	-- 猎手阿尔迪莫，巴加斯特之影
	[165556] = true,	-- 赤红深渊，瞬息具象
	[163746] = true,	-- 垃圾场，步行震击者X1型
	[114247] = true,	-- 卡上，馆长
}

-- 显示姓名板单位的目标
C.ShowTargetNPCs = {
	[165251] = true,	-- 仙林狐狸
	[174773] = true,	-- 怨毒怪
}

-- 无效目标
C.TrashUnits = {
	[166589] = true,	-- 活化武器，赤红
	[169753] = true,	-- 饥饿的虱子，赤红
	[175677] = true,	-- 走私来的生物，集市
	[190174] = true,	-- 催眠蝙蝠，S4
}

-- 重要读条高亮
C.MajorSpells = {
	[156718] = true,	-- 骨疽爆裂，影月墓地
	[156776] = true,	-- 虚空撕裂，影月墓地
	[398150] = true,	-- 统御，影月墓地
	[398206] = true,	-- 死亡冲击，影月墓地
	[152964] = true,	-- 虚空脉冲，影月墓地
	[198595] = true,	-- 雷霆飞弹，英灵殿
	[396812] = true,	-- 秘法冲击，学院
	[397889] = true,	-- 海潮爆发，青龙寺
	[395859] = true,	-- 游荡尖啸，青龙寺
	[397878] = true,	-- 魔化涟漪，青龙寺
	[392451] = true,	-- 闪火，红玉
	[392452] = true,	-- 闪火，红玉
	[385536] = true,	-- 烈焰之舞，红玉
	[372087] = true,	-- 炽焰冲刺，红玉
	[372735] = true,	-- 大地裂击，红玉
	[388283] = true,	-- 喷发，阻击战
	[387440] = true,	-- 亵渎咆哮，阻击战
	[386012] = true,	-- 风暴之箭，阻击战
	[374720] = true,	-- 吞噬践踏，碧蓝
	[372222] = true,	-- 奥术顺劈，碧蓝
	[386546] = true,	-- 清醒的克星，碧蓝
	[387564] = true,	-- 秘法蒸汽，碧蓝
	-- S2
	[257397] = true,	-- 治疗药膏，自由镇
	[369411] = true,	-- 音速爆裂，奥达曼
}