local _, C, _, _ = unpack(select(2, ...))

-- 控制技能列表
C.WhiteList = {
	-- 死亡骑士
	[108194]	= true,		-- 窒息
	[221562]	= true,		-- 窒息
	[207171]	= true,		-- 凛冬将至
	-- 德鲁伊
	[33786] 	= true,		-- 旋风
	[339]		= true,		-- 纠缠根须
	[102359]	= true,		-- 群体缠绕
	[5211]		= true,		-- 蛮力猛击
	[127797]	= true,		-- 乌索尔旋风
	[81261]		= true,		-- 日光术
	-- 猎人
	[3355]		= true,		-- 冰冻陷阱
	[19386] 	= true,		-- 翼龙钉刺
	[213691] 	= true,		-- 驱散射击
	[224729] 	= true,		-- 爆裂射击
	[202797] 	= true,		-- 蝰蛇钉刺
	[202900] 	= true,		-- 毒蝎钉刺
	[117526]	= true,		-- 束缚射击
	-- 法师
	[118] 		= true,		-- 变形术
	-- 圣骑士
	[20066] 	= true,		-- 忏悔
	[853] 		= true,		-- 制裁之锤
	-- 牧师
	[8122] 		= true,		-- 心灵尖啸
	[9484] 		= true,		-- 束缚亡灵
	[15487] 	= true,		-- 沉默
	[605] 		= true,		-- 心控
	[205369] 	= true,		-- 心灵炸弹
	-- 盗贼
	[2094] 		= true,		-- 致盲
	[6770] 		= true,		-- 闷棍
	-- 萨满
	[51514] 	= true,		-- 妖术
	[118905] 	= true,		-- 静电充能
	-- 术士
	[710] 		= true,		-- 放逐术
	[118699] 	= true,		-- 恐惧
	[5484] 		= true,		-- 恐惧嚎叫
	[6358]		= true,		-- 诱惑
	[30283] 	= true,		-- 暗影之怒
	-- 战士
	[132168] 	= true,		-- 震荡波
	[132169] 	= true,		-- 风暴之锤
	-- 武僧
	[115078] 	= true,		-- 分筋错骨
	[119381] 	= true,		-- 扫堂腿
	-- 恶魔猎手
	[217832] 	= true,		-- 禁锢
	[179057] 	= true,		-- 混乱新星
	-- 种族技能
	[25046] 	= true,		-- 奥术洪流
	[20549] 	= true,		-- 战争践踏
	[107079] 	= true,		-- 震山掌
	-- 其他
	[226510]	= true,		-- 血池
}

-- 法术黑名单
C.BlackList = {
	[15407]		= true,		-- 精神鞭笞
}

--[[
	团队模式的法术列表说明：
	当右侧为"none"时，队友拥有左侧ID指代的BUFF时显示；
	当右侧为"compare"时，左侧ID指代BUFF是队友与你同时拥有时，显示绿色箭头，否则就显示红色箭头；
	当右侧为ID时，玩家自身拥有右侧ID指代的BUFF时，队友才会显示左侧ID指代的BUFF。
]]
C.RaidAuras = {
-- Test
	--[227723] = "none",
	--[144941] = "none",
	--[232698] = "none",
-- 翡翠梦魇
	-- 四龙
	[203787] = "none",		-- 快速传染
-- 勇气试练
	-- 高姆
	[228818] = "none",		-- 阴暗泡沫
	[228810] = "none",		-- 咸味泡沫
	[228744] = "none",		-- 燃烧泡沫
	[228769] = 228818,		-- 黑暗宣泄
	[228768] = 228810,		-- 盐水唾沫
	[228758] = 228744,		-- 烈火粘质
-- 暗夜要塞
	-- 时空畸体
	[206617] = "none",		-- 时间炸弹
	-- 崔力艾克斯
	[207327] = "none",		-- 净化毁灭
	-- 魔剑士
	[212647] = 212587,		-- 霜害
	-- 植物学家
	[218342] = "none",		-- 寄生凝视
	-- 克罗苏斯
	[205344] = "none",		-- 毁灭之球
	-- 提克迪奥斯
	[206480] = "none",		-- 腐肉瘟疫
	-- 占星师
	[205445] = "compare",	-- 天狼
	[205429] = "compare",	-- 巨蟹
	[216345] = "compare",	-- 猎户
	[216344] = "compare",	-- 天龙
	-- 小姐姐
	[209244] = "none",		-- 神秘射线
	-- 古尔丹
	[221606] = "none",		-- 萨格拉斯之焰
	[221603] = "none",		-- 萨格拉斯之焰
-- 萨格拉斯之墓
	-- 哈亚坦
	[241600] = "none",		-- 水之爆发
}

-- 匹配判断材质
C.CustomIcons = {
	[1] = 236595,			-- 匹配成功，绿色箭头
	[2] = 236612,			-- 匹配失败，红色箭头
}

-- 显示能量值的单位
C.ShowPowerUnit = {
	["Scrubber"] = true,
	["清扫器"] = true,
	["清掃者"] = true,
}